[
  {
    "url": "wildisles",
    "tab": "Save Our Wild Isles case study",
    "image": "/images/portfolio-silverstone.png",
    "icon": "folder folder--shortcut",
    "logo": "/images/wildisles.svg",
    "headline": "Creating an informative and sleek component based site to accompany the BBC series.",
    "section_1_title": "Providing an online hub of information to support the Wild Isles series",
    "section_1_text": [
      "We are at risk of losing the beautiful nature of the British Isles. But there is still time to save it. To support the BBC Wild Isles mission, Catch Digital worked with WWF, RSPB and National Trust to design and build a website that would showcase what the British Wild Isles have to offer and highlight why they are worth saving."
    ],
    "section_1_image": "/images/wild-isles-section-1.png",
    "live_site": "https://www.saveourwildisles.org.uk",
    "alias": "saveourwildisles.org.uk",
    "stack": "Prismic, Amplify, Next.js, Typescript",
    "section_2_text": [
      "Speed was an important factor for this build as the air date of the series gave the project a hard deadline. The site needed to be live and bug free before the tv series released.",
      "Using Prismic, Next.js and Typescript we were able to quickly build a component based website.",
      "Typescript was new to me, and gave a steep learning curve to start with but being a quick learner and asking questions when needed meant this didn't impact the deadline."
    ],
    "section_2_image": "/images/wild-isles-section-2.png",
    "section_3_text": [
      "As the primary front end developer I established a solid foundation to the website and project by building out a component based system. This systematic approach meant styled components could be consistently used across the site.",
      "A core part of my approach was to ensure maintainability of the site and where possible breaking down components into smaller more manageable chunks, reusing parts where I could - reducing repeated code."
    ],
    "section_3_image": "/images/wild-isles-section-3.png",
    "section_4_text": [
      "In just 6 short weeks the site was ready to go live alongside the anticipated new series aired on the BBC.",
      "Myself and Catch received great feedback from the client, who were extremely happy with the work we had produced in a short space of time."
    ],
    "section_4_image": "/images/wild-isles-section-4.png"
  },
  {
    "url": "ciu",
    "tab": "CIU case study",
    "image": "/images/portfolio-silverstone.png",
    "icon": "folder folder--shortcut",
    "logo": "/images/ciu-logo.svg",
    "headline": "Cyprus International University - People from 110 different countries brought together on one campus.",
    "section_1_title": "A full rebuild to bring more cultures from the world to CIU",
    "section_1_text": "Creating a diverse environment that enables a phenomenal opportunity for new experiences and learning.",
    "section_1_image": "/images/ciu-section-1.png",
    "live_site": "https://www.ciu.edu.tr/",
    "alias": "ciu.edu.tr",
    "stack": "Drupal 9, Twig, SCSS, Javascript",
    "section_2_text": [
      "Working in sprints to produce reusable page components for the client to give them flexibility to show off the programs they run at the university."
    ],
    "section_2_image": "/images/ciu-section-2.png",
    "section_3_text": [
      "Being the primary front end developer on this project I made sure to communicate with the designers, back end developers and project manager to make sure the project ran to the delivery timeline."
    ],
    "section_3_image": "/images/ciu-section-3.png",
    "section_4_text": [
      "A sleek new site that is functional and customisable using various components that the client can easily and quickly make new pages on the site with."
    ],
    "section_4_image": "/images/ciu-section-4.png"
  },
  {
    "url": "silverstone",
    "tab": "Silverstone case study",
    "image": "/images/portfolio-silverstone.png",
    "icon": "folder folder--shortcut",
    "logo": "/images/silverstone-logo.svg",
    "headline": "Building a world class website for one of the UK’s biggest sport’s brand.",
    "section_1_title": "Transforming the digital presence of UK’s motorsport",
    "section_1_text": "Silverstone asked everything—connected to create a fully functional site that reflects the company’s branding and values. The goal was to create a buzz similar to the race track while aiding people to prepare for their visit on race day.",
    "section_1_image": "/images/silverstone-section-1.png",
    "live_site": "https://www.silverstone.co.uk/",
    "alias": "silverstone.co.uk",
    "stack": "Drupal 8, Twig, SCSS, Javascript",
    "section_2_text": [
      "Based on wireframes and designed components from the design team, I worked with the rest of the tech unit to sprint plan and estimated the front end development resources needed.",
      "As timelines were tight, we decided to use Launchpad, a Drupal distribution website starter kit I had previously worked on. Launchpad was built to reduce the time spent on repetitive tasks when starting a new development project."
    ],
    "section_2_image": "/images/silverstone-section-2.png",
    "section_3_text": [
      "As the primary front end developer, I had to constantly liaise with the design and project management team to ensure the build represented the designs and kept to client timelines.",
      "Though working initially alone, I used git to commit changes to our repository for version control and collect feedback on my pull requests to maintain a high code level."
    ],
    "section_3_image": "/images/silverstone-section-3.png",
    "section_4_text": [
      "Though there were challenges throughout this 9 month-long project, I had successfully worked with backend developers to create a functional and customisable site, that the content team could create and design new pages in.",
      "Since launch, we have received positive feedback and are working alongside Silverstone to improve the user experience and efficiency of the build."
    ],
    "section_4_image": "/images/silverstone-section-4.png"
  },
  {
    "url": "jmfinn",
    "tab": "JMFinn case study",
    "image": "/images/portfolio-jmfinn.png",
    "icon": "folder folder--shortcut",
    "logo": "/images/jmfinn-logo.svg",
    "headline": "Headless Gatsby build using Drupal as the CMS.",
    "section_1_title": "Challenging the traditional approach to financial services",
    "section_1_text": "JM Finn approached everything—connected to reimagine their brand to stand out from other financial institutions without separating from their existing client base. This update also created an opportunity to modernise the tech stack used on their website to mirror their disruptor strategy.",
    "section_1_image": "/images/jmfinn-section-1.png",
    "live_site": "https://www.jmfinn.com/",
    "alias": "jmfinn.com",
    "stack": "Gatsby, GraphQL, Drupal 8 CMS",
    "section_2_text": [
      "As JM Finn had well-established content which was working successfully in communicating their mission and other information, the development effort was to update their front end layer to introduce the new branding while focusing on improving the speed and efficiency of the website.",
      "This project felt like a prime opportunity to push the development team forward, and I advocated for using a headless Drupal build due to the security benefits and the default speed improvements that come with the approach."
    ],
    "section_2_image": "/images/jmfinn-section-2.png",
    "section_3_text": [
      "Working as part of a team, I directed my efforts on building new components and styling them per the designs. Part of my role was to review pull requests via bitbucket and help my coworkers with any code challenges we came across. Also to ensure we kept to our goals of guaranteeing speed improvements and security of the new headless site."
    ],
    "section_3_image": "/images/jmfinn-section-3.png",
    "section_4_text": [
      "Since launching the new JM Finn brand and website, they have won new business and multiple industry awards. We attribute this not to just their great offering but also their industry challenging rebrand and speedy, informative, and functional website."
    ],
    "section_4_image": "/images/jmfinn-section-4.png"
  }
]
